{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[STOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SPACE]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[STOP]": 0,
      "[UNK]": 1,
      "[SPACE]": 2,
      "'": 3,
      ",": 4,
      ".": 5,
      "1": 6,
      "2": 7,
      "3": 8,
      "4": 9,
      "5": 10,
      "6": 11,
      "8": 12,
      "?": 13,
      "a": 14,
      "b": 15,
      "c": 16,
      "d": 17,
      "e": 18,
      "f": 19,
      "g": 20,
      "h": 21,
      "i": 22,
      "j": 23,
      "k": 24,
      "l": 25,
      "m": 26,
      "n": 27,
      "o": 28,
      "p": 29,
      "q": 30,
      "r": 31,
      "s": 32,
      "t": 33,
      "u": 34,
      "v": 35,
      "w": 36,
      "x": 37,
      "y": 38,
      "z": 39,
      "、": 40,
      "。": 41,
      "，": 42,
      "？": 43,
      "an": 44,
      "i4": 45,
      "sh": 46,
      "ng": 47,
      "e5": 48,
      "u4": 49,
      "zh": 50,
      "i3": 51,
      "i2": 52,
      "ao": 53,
      "ang": 54,
      "ji": 55,
      "en": 56,
      "e4": 57,
      "de5": 58,
      "xi": 59,
      "i1": 60,
      "uo": 61,
      "shi4": 62,
      "an4": 63,
      "u3": 64,
      "ong": 65,
      "a1": 66,
      "wo": 67,
      "wo3": 68,
      "ao4": 69,
      "a4": 70,
      "an2": 71,
      "eng": 72,
      "hu": 73,
      "ai4": 74,
      "an1": 75,
      "ing": 76,
      "ao3": 77,
      "u2": 78,
      "ang4": 79,
      "e2": 80,
      "ou3": 81,
      "ni3": 82,
      "ai2": 83,
      "le5": 84,
      "en2": 85,
      "zhe4": 86,
      "ch": 87,
      "ge4": 88,
      "a5": 89,
      "an3": 90,
      "e3": 91,
      "u1": 92,
      "bu4": 93,
      "you3": 94,
      "yi1": 95,
      "n1": 96,
      "ang1": 97,
      "ta1": 98,
      "ang3": 99,
      "uo1": 100,
      "jiu4": 101,
      "zai4": 102,
      "ong1": 103,
      "ou4": 104,
      "uo4": 105,
      "shi2": 106,
      "eng2": 107,
      "ei4": 108,
      "li": 109,
      "ren2": 110,
      "men": 111,
      "men5": 112,
      "ui4": 113,
      "en1": 114,
      "qi": 115,
      "dao4": 116,
      "ang2": 117,
      "ing2": 118,
      "a3": 119,
      "shuo1": 120,
      "e1": 121,
      "na4": 122,
      "ei2": 123,
      "lai2": 124,
      "er": 125,
      "ou1": 126,
      "me5": 127,
      "en3": 128,
      "yu": 129,
      "hou4": 130,
      "yao4": 131,
      "eng1": 132,
      "yi2": 133,
      "ong4": 134,
      "n2": 135,
      "yi3": 136,
      "yi4": 137,
      "ei3": 138,
      "ao1": 139,
      "wei4": 140,
      "bi": 141,
      "chu": 142,
      "da4": 143,
      "hao3": 144,
      "gu": 145,
      "ti": 146,
      "ai1": 147,
      "shang4": 148,
      "n4": 149,
      "hai2": 150,
      "ong2": 151,
      "dui4": 152,
      "ni": 153,
      "uo3": 154,
      "zhi1": 155,
      "jia1": 156,
      "ye3": 157,
      "di": 158,
      "li3": 159,
      "mei2": 160,
      "hui4": 161,
      "jing": 162,
      "dou1": 163,
      "en4": 164,
      "er2": 165,
      "ing4": 166,
      "neng2": 167,
      "he2": 168,
      "ue2": 169,
      "qu4": 170,
      "ing1": 171,
      "ke3": 172,
      "i5": 173,
      "xing": 174,
      "eng4": 175,
      "zi5": 176,
      "zuo4": 177,
      "ne5": 178,
      "xin1": 179,
      "xia4": 180,
      "bu2": 181,
      "xiang3": 182,
      "xian4": 183,
      "uo2": 184,
      "sheng1": 185,
      "shen2": 186,
      "ong3": 187,
      "tian1": 188,
      "zi4": 189,
      "kan4": 190,
      "a2": 191,
      "guo4": 192,
      "ai3": 193,
      "duo1": 194,
      "zhong1": 195,
      "mi": 196,
      "gong1": 197,
      "cheng2": 198,
      "di4": 199,
      "chu1": 200,
      "xiao3": 201,
      "ao2": 202,
      "yi": 203,
      "jing1": 204,
      "qu": 205,
      "ji3": 206,
      "hua4": 207,
      "qian2": 208,
      "ou2": 209,
      "ran2": 210,
      "li4": 211,
      "jian4": 212,
      "gen1": 213,
      "ji4": 214,
      "jue2": 215,
      "gei3": 216,
      "nian2": 217,
      "hen3": 218,
      "ei1": 219,
      "yang4": 220,
      "ma5": 221,
      "dian3": 222,
      "suo3": 223,
      "n3": 224,
      "zhe5": 225,
      "zhu": 226,
      "xi1": 227,
      "dan4": 228,
      "xiang4": 229,
      "yin1": 230,
      "ku": 231,
      "zhi4": 232,
      "ji1": 233,
      "ba5": 234,
      "zhi3": 235,
      "xing2": 236,
      "qi3": 237,
      "qi2": 238,
      "de2": 239,
      "mian4": 240,
      "bei4": 241,
      "lao3": 242,
      "ming2": 243,
      "ing3": 244,
      "guan1": 245,
      "ru2": 246,
      "zhen1": 247,
      "ba3": 248,
      "dang1": 249,
      "qing2": 250,
      "guo2": 251,
      "shu": 252,
      "jin1": 253,
      "zui4": 254
    },
    "merges": [
      "a n",
      "i 4",
      "s h",
      "n g",
      "e 5",
      "u 4",
      "z h",
      "i 3",
      "i 2",
      "a o",
      "an g",
      "j i",
      "e n",
      "e 4",
      "d e5",
      "x i",
      "i 1",
      "u o",
      "sh i4",
      "an 4",
      "u 3",
      "o ng",
      "a 1",
      "w o",
      "wo 3",
      "ao 4",
      "a 4",
      "an 2",
      "e ng",
      "h u",
      "a i4",
      "an 1",
      "i ng",
      "ao 3",
      "u 2",
      "ang 4",
      "e 2",
      "o u3",
      "n i3",
      "a i2",
      "l e5",
      "en 2",
      "zh e4",
      "c h",
      "g e4",
      "a 5",
      "an 3",
      "e 3",
      "u 1",
      "b u4",
      "y ou3",
      "y i1",
      "n 1",
      "ang 1",
      "t a1",
      "ang 3",
      "uo 1",
      "ji u4",
      "z ai4",
      "ong 1",
      "o u4",
      "uo 4",
      "sh i2",
      "eng 2",
      "e i4",
      "l i",
      "r en2",
      "m en",
      "men 5",
      "u i4",
      "en 1",
      "q i",
      "d ao4",
      "ang 2",
      "ing 2",
      "a 3",
      "sh uo1",
      "e 1",
      "n a4",
      "e i2",
      "l ai2",
      "e r",
      "o u1",
      "m e5",
      "en 3",
      "y u",
      "h ou4",
      "y ao4",
      "eng 1",
      "y i2",
      "ong 4",
      "n 2",
      "y i3",
      "y i4",
      "e i3",
      "ao 1",
      "w ei4",
      "b i",
      "c hu",
      "d a4",
      "h ao3",
      "g u",
      "t i",
      "a i1",
      "sh ang4",
      "n 4",
      "h ai2",
      "ong 2",
      "d ui4",
      "n i",
      "uo 3",
      "zh i1",
      "ji a1",
      "y e3",
      "d i",
      "l i3",
      "m ei2",
      "hu i4",
      "ji ng",
      "d ou1",
      "en 4",
      "er 2",
      "ing 4",
      "n eng2",
      "h e2",
      "u e2",
      "q u4",
      "ing 1",
      "k e3",
      "i 5",
      "xi ng",
      "eng 4",
      "z i5",
      "z uo4",
      "n e5",
      "xi n1",
      "xi a4",
      "b u2",
      "xi ang3",
      "xi an4",
      "uo 2",
      "sh eng1",
      "sh en2",
      "ong 3",
      "ti an1",
      "z i4",
      "k an4",
      "a 2",
      "g uo4",
      "a i3",
      "d uo1",
      "zh ong1",
      "m i",
      "g ong1",
      "ch eng2",
      "d i4",
      "chu 1",
      "xi ao3",
      "ao 2",
      "y i",
      "jing 1",
      "q u",
      "j i3",
      "hu a4",
      "qi an2",
      "o u2",
      "r an2",
      "l i4",
      "ji an4",
      "g en1",
      "j i4",
      "j ue2",
      "g ei3",
      "ni an2",
      "h en3",
      "e i1",
      "y ang4",
      "m a5",
      "di an3",
      "s uo3",
      "n 3",
      "zh e5",
      "zh u",
      "xi 1",
      "d an4",
      "xi ang4",
      "yi n1",
      "k u",
      "zh i4",
      "ji 1",
      "b a5",
      "zh i3",
      "xing 2",
      "q i3",
      "q i2",
      "d e2",
      "mi an4",
      "b ei4",
      "l ao3",
      "m ing2",
      "ing 3",
      "gu an1",
      "r u2",
      "zh en1",
      "b a3",
      "d ang1",
      "q ing2",
      "g uo2",
      "sh u",
      "ji n1",
      "z ui4"
    ]
  }
}